"Western (Mac OS Roman)" = "الغربية (Mac OS Roman)";
"Japanese (Mac OS)" = "اليابانية (Mac OS)";
"Traditional Chinese (Mac OS)" = "الصينية التقليدية (Mac OS)";
"Korean (Mac OS)" = "الكورية (Mac OS)";
"Arabic (Mac OS)" = "العربية (Mac OS)";
"Hebrew (Mac OS)" = "العبرية (Mac OS)";
"Greek (Mac OS)" = "اليونانية (Mac OS)";
"Cyrillic (Mac OS)" = "السيريلية (Mac OS)";
"Devanagari (Mac OS)" = "الديفاناجارية (Mac OS)";
"Gurmukhi (Mac OS)" = "الجرمخية (Mac OS)";
"Gujarati (Mac OS)" = "التاغجراتية (Mac OS)";
"Thai (Mac OS)" = "التايلاندية (Mac OS)";
"Simplified Chinese (Mac OS)" = "الصينية المبسّطة (Mac OS)";
"Tibetan (Mac OS)" = "التيبتية (Mac OS)";
"Central European (Mac OS)" = "أوروبا الوسطى (Mac OS)";
"Symbol (Mac OS)" = "رمز (Mac OS)";
"Dingbats (Mac OS)" = "زخارف (Mac OS)";
"Turkish (Mac OS)" = "التركية (Mac OS)";
"Croatian (Mac OS)" = "الكرواتية (Mac OS)";
"Icelandic (Mac OS)" = "الآيسلندية (Mac OS)";
"Romanian (Mac OS)" = "الرومانية (Mac OS)";
"Celtic (Mac OS)" = "السلتية (Mac OS)";
"Gaelic (Mac OS)" = "الغالّية (Mac OS)";
"Keyboard Symbols (Mac OS)" = "رموز لوحة المفاتيح (Mac OS)";
"Farsi (Mac OS)" = "الفارسية (Mac OS)";
"Cyrillic (Mac OS Ukrainian)" = "السيريلية (Mac OS الأوكرانية)";
"Inuit (Mac OS)" = "إنويت (Mac OS)";
"Unicode (UTF-16)" = "Unicode (UTF-16)";
"Unicode (UTF-7)" = "Unicode (UTF-7)";
"Unicode (UTF-8)" = "Unicode (UTF-8)";
"Unicode (UTF-32)" = "Unicode (UTF-32)";
"Unicode (UTF-16BE)" = "Unicode (UTF-16BE)";
"Unicode (UTF-16LE)" = "Unicode (UTF-16LE)";
"Unicode (UTF-32BE)" = "Unicode (UTF-32BE)";
"Unicode (UTF-32LE)" = "Unicode (UTF-32LE)";
"Western (ISO Latin 1)" = "الغربية (ISO Latin 1)";
"Central European (ISO Latin 2)" = "أوروبا الوسطى (ISO Latin 2)";
"Western (ISO Latin 3)" = "الغربية (ISO Latin 3)";
"Central European (ISO Latin 4)" = "أوروبا الوسطى (ISO Latin 4)";
"Cyrillic (ISO 8859-5)" = "السيريلية (ISO 8859-5)";
"Arabic (ISO 8859-6)" = "العربية (ISO 8859-6)";
"Greek (ISO 8859-7)" = "اليونانية (ISO 8859-7)";
"Hebrew (ISO 8859-8)" = "العبرية (ISO 8859-8)";
"Turkish (ISO Latin 5)" = "التركية (ISO Latin 5)";
"Nordic (ISO Latin 6)" = "الاسكندنافية (ISO Latin 6)";
"Thai (ISO 8859-11)" = "التايلاندية (ISO 8859-11)";
"Baltic (ISO Latin 7)" = "البلطيقية (ISO Latin 7)";
"Celtic (ISO Latin 8)" = "السلتية (ISO Latin 8)";
"Western (ISO Latin 9)" = "الغربية (ISO Latin 9)";
"Romanian (ISO Latin 10)" = "الرومانية (ISO Latin 10)";
"Latin-US (DOS)" = "اللاتينية - الأميركية (DOS)";
"Greek (DOS)" = "اليونانية (DOS)";
"Baltic (DOS)" = "البلطيقية (DOS)";
"Western (DOS Latin 1)" = "الغربية (DOS Latin 1)";
"Greek (DOS Greek 1)" = "اليونانية (DOS اليونانية 1)";
"Central European (DOS Latin 2)" = "أوروبا الوسطى (DOS Latin 2)";
"Cyrillic (DOS)" = "السيريلية (DOS)";
"Turkish (DOS)" = "التركية (DOS)";
"Portuguese (DOS)" = "البرتغالية (DOS)";
"Icelandic (DOS)" = "الآيسلندية (DOS)";
"Hebrew (DOS)" = "العبرية (DOS)";
"Canadian French (DOS)" = "الفرنسية الكندية (DOS)";
"Arabic (DOS)" = "العربية (DOS)";
"Nordic (DOS)" = "الاسكندنافية (DOS)";
"Russian (DOS)" = "الروسية (DOS)";
"Greek (DOS Greek 2)" = "اليونانية (DOS اليونانية 2)";
"Thai (Windows, DOS)" = "التايلاندية (Windows, DOS)";
"Japanese (Windows, DOS)" = "اليابانية (Windows, DOS)";
"Simplified Chinese (Windows, DOS)" = "الصينية المبسّطة (Windows, DOS)";
"Korean (Windows, DOS)" = "الكورية (Windows, DOS)";
"Traditional Chinese (Windows, DOS)" = "الصينية التقليدية (Windows, DOS)";
"Western (Windows Latin 1)" = "الغربية (Windows Latin 1)";
"Central European (Windows Latin 2)" = "أوروبا الوسطى (Windows Latin 2)";
"Cyrillic (Windows)" = "السيريلية (Windows)";
"Greek (Windows)" = "اليونانية (Windows)";
"Turkish (Windows Latin 5)" = "التركية (Windows Latin 5)";
"Hebrew (Windows)" = "العبرية (Windows)";
"Arabic (Windows)" = "العربية (Windows)";
"Baltic (Windows)" = "البلطيقية (Windows)";
"Vietnamese (Windows)" = "الفيتنامية (Windows)";
"Western (ASCII)" = "الغربية (ASCII)";
"Japanese (Shift JIS X0213)" = "اليابانية (Shift JIS X0213)";
"Chinese (GBK)" = "الصينية (GBK)";
"Chinese (GB 18030)" = "الصينية (GB 18030)";
"Japanese (ISO 2022-JP)" = "اليابانية (ISO 2022-JP)";
"Japanese (ISO 2022-JP-2)" = "اليابانية (ISO 2022-JP-2)";
"Japanese (ISO 2022-JP-1)" = "اليابانية (ISO 2022-JP-1)";
"Chinese (ISO 2022-CN)" = "الصينية (ISO 2022-CN)";
"Korean (ISO 2022-KR)" = "الكورية (ISO 2022-KR)";
"Japanese (EUC)" = "اليابانية (EUC)";
"Simplified Chinese (GB 2312)" = "الصينية المبسّطة ((GB 2312)";
"Traditional Chinese (EUC)" = "الصينية التقليدية (EUC)";
"Korean (EUC)" = "الكورية (EUC)";
"Japanese (Shift JIS)" = "اليابانية (Shift JIS)";
"Cyrillic (KOI8-R)" = "السيريلية (KOI8-R)";
"Traditional Chinese (Big 5)" = "الصينية التقليدية (Big 5)";
"Western (Mac Mail)" = "الغربية (Mac Mail)";
"Simplified Chinese (HZ GB 2312)" = "الصينية المبسّطة (HZ GB 2312)";
"Traditional Chinese (Big 5 HKSCS)" = "الصينية التقليدية (Big 5 HKSCS)";
"Ukrainian (KOI8-U)" = "الأوكرانية (KOI8-U)";
"Traditional Chinese (Big 5-E)" = "الصينية التقليدية (Big 5-E)";
"Western (NextStep)" = "الغربية (NextStep)";
"Non-lossy ASCII" = "Non-lossy ASCII";
"Western (EBCDIC Latin Core)" = "الغربية (EBCDIC Latin Core)";
"Western (EBCDIC Latin 1)" = "الغربية (EBCDIC Latin 1)";
"Japanese (Auto Detect)" = "اليابانية (إكتشاف تلقائي)";
